# -*- coding: utf-8 -*-

=begin

================================================================================

Class: Friendship

Description:
  Модель отношений дружбы. По другому: список друзей.

  Условно можно разделить на три списка друзей:
    * друзья (двусторонняя связь)
    * запросы на добавление в список друзей к пользователю владельцу
    * запросы на добавление в список друзей от пользователя владельца

================================================================================

Поля:
  * friend_ids           _id пользователей друзей
  * request_to_ids       _id пользователей, которые прислали запросы
  * request_from_ids     _id пользователей, которым отослали запросы
  * friends_count        число друзей
  * requests_to_count    число запросов к пользователю
  * requests_from_count  число запросов от пользователя

================================================================================

Copyright (c) 2011, Alexey Plutalov <demiazz.py@gmail.com>

================================================================================

=end

class Friendship
  include Mongoid::Document

  #=============================================================================
  # Поля модели
  #=============================================================================

  # _id друзей
  field :friend_ids, :type => Array, :default => []
  # _id пользователей, которые прислали запросы
  field :request_to_ids, :type => Array, :default => []
  # _id пользователей, которым отосланы запросы
  field :request_from_ids, :type => Array, :default => []
  # число друзей
  field :friends_count, :type => Integer, :default => 0
  # число присланных запросов
  field :requests_to_count, :type => Integer, :default => 0
  # число отосланных запросов
  field :requests_from_count, :type => Integer, :default => 0

end
