# -*- coding: utf-8 -*-

=begin

================================================================================

Class: Mail

Description:
  Модель хранения информации о почте пользователя.

  Позволяет:
    * хранить статистику о почте пользователя.

================================================================================

Поля:
  * following_ids       _id пользователей, на кого подписан
  * follower_ids        _id пользователей, кто подписан
  * followings_count    число пользователей, на кого подписан
  * followers_count     число пользователей, кто подписан
  * posts_count         число постов

Связи:
  * owner               1 к 1 - имеет одного владельца

Scopes:
  * owner_id            получить по id владельца

================================================================================

Copyright (c) 2011, Alexey Plutalov <demiazz.py@gmail.com>

================================================================================

=end

class Mail
  include Mongoid::Document

  #=============================================================================
  # Поля модели
  #=============================================================================

  # число входящих сообщений
  field :inbox_count, :type => Integer, :default => 0
  # число входящих прочитанных сообщений
  field :inbox_read_count, :type => Integer, :default => 0
  # число входящих непрочитанных сообщений
  field :inbox_unread_count, :type => Integer, :default => 0
  # число исходящих сообщений
  field :outbox_count, :type => Integer, :default => 0
  # число исходящих прочитанных сообщений
  field :outbox_read_count, :type => Integer, :default => 0
  # число исходящих непрочитанных сообщений
  field :outbox_unread_count, :type => Integer, :default => 0

  #=============================================================================
  # Связи
  #=============================================================================

  # имеет одного владельца
  belongs_to :owner, :class_name => "User", :inverse_of => :mail

  #=============================================================================
  # Scopes
  #=============================================================================

  scope :owner_id, ->(id) { where(:owner_id => id) }

end
