# -*- coding: utf-8 -*-

=begin

================================================================================

Class: Message

Description:
  Модель почтового сообщения.

================================================================================

Поля:
  * subject  тема сообщения
  * text     текст сообщения

================================================================================

Copyright (c) 2011, Alexey Plutalov <demiazz.py@gmail.com>

================================================================================

=end

class Message
  include Mongoid::Document

  #=============================================================================
  # Поля модели
  #=============================================================================

  # тема сообщения
  field :subject, :type => String, :default => ""
  # текст сообщения
  field :text, :type => String, :default => ""

end
