# -*- coding: utf-8 -*-

=begin

================================================================================

Class: Message

Description:
  Модель почтового сообщения.

================================================================================

Поля:
  * subject  тема сообщения
  * text     текст сообщения
  * status   статус сообщения

================================================================================

Copyright (c) 2011, Alexey Plutalov <demiazz.py@gmail.com>

================================================================================

=end

class Message
  include Mongoid::Document
  include Mongoid::Timestamps

  #=============================================================================
  # Поля модели
  #=============================================================================

  # тема сообщения
  field :subject, :type => String, :default => ""
  # текст сообщения
  field :text, :type => String, :default => ""
  # статус сообщения
  field :status, :type => Boolean, :default => false

  #=============================================================================
  # Связи
  #=============================================================================

  belongs_to :sender, :class_name => "User", :inverse_of => :outbox_messages
  belongs_to :recipient, :class_name => "User", :inverse_of => :inbox_messages

end
